# Dotfiles Brewfile
# Install with: brew bundle --file=~/.dotfiles/Brewfile

# Core tools
brew "node"
brew "php"
brew "composer"
brew "pkg-config"
brew "wget"
brew "httpie"
brew "ncdu"
brew "hub"
brew "gh"
brew "ack"
brew "doctl"
brew "tmux"
brew "pyenv"
brew "uv"
brew "bitwarden-cli"
brew "git-secret"
brew "imagemagick"
brew "mackup"

# Zsh
brew "zsh-autosuggestions"

# Modern CLI tools
brew "starship"
brew "zoxide"
brew "bat"
brew "eza"
brew "ripgrep"
brew "fd"
brew "git-delta"
brew "fnm"
brew "fzf"
brew "direnv"
brew "jq"
brew "yq"
brew "bottom"
brew "glab"
tap "retlehs/tap"
brew "retlehs/tap/quien"

# Development tools
brew "micro"
cask "claude-code"
# brew "opencode"
cask "zed"
cask "clipy"
cask "ghostty"
cask "obsidian"
cask "core-tunnel"


# QuickLook plugins
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "qlprettypatch"
cask "quicklook-csv"
cask "betterzip"
cask "suspicious-package"
cask "syntax-highlight"
